ka2_2024/src/Enums/ТипыПервичныхДокументов/ТипыПервичныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПервичныхДокументов</name>
  <enumValues>
    <name>ПриобретениеУПоставщика</name>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ОплатаОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВнутренняяНакладная</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаЧерезПодотчетноеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ПриемНаХранение</name>
  </enumValues>
  <enumValues>
    <name>ОтчетДавальцу</name>
  </enumValues>
  <enumValues>
    <name>ОтчетПереработчика</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаРеализации</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаПриобретения</name>
  </enumValues>
  <enumValues>
    <name>АктПремииКлиенту</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Enums/ТипыПервичныхДокументов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет в переданный параметр значения перечисление "Типы первичных документов"
//
// Параметры:
//  ДанныеВыбора - СписокЗначений из ПеречислениеСсылка.ТипыПервичныхДокументов
//  			 - Массив из ПеречислениеСсылка.ТипыПервичныхДокументов - коллекция, в которую добавляются значения перечисление
//  Параметры    - см. ПараметрыИспользования
//
Процедура ЗаполнитьДанныеВыбора(ДанныеВыбора, Знач Параметры = Неопределено) Экспорт
	
	Если Параметры = Неопределено Тогда
		Параметры = ПараметрыИспользования();
	КонецЕсли;
	
	ДанныеВыбора.Очистить();
	
	Для каждого Параметр Из Параметры Цикл
		
		Если Параметр.Значение Тогда
			ДанныеВыбора.Добавить(Перечисления.ТипыПервичныхДокументов[Параметр.Ключ]);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает параметры использования типов первичных документов.
//
// Возвращаемое значение:
//  Структура - содержит:
//   * ПриобретениеУПоставщика     - Булево - 
//   * РеализацияКлиенту           - Булево - 
//   * КорректировкаПриобретения   - Булево - 
//   * КорректировкаРеализации     - Булево - 
//   * ОплатаПоставщику            - Булево - 
//   * ОплатаОтКлиента             - Булево -
//   * АктПремииКлиенту            - Булево -
//   * АктПремииПоставщика         - Булево -
//   * ВнутренняяНакладная         - Булево -
//   * ЗакупкаЧерезПодотчетноеЛицо - Булево -
//   * ПриемНаХранение             - Булево -
//   * ОтчетДавальцу               - Булево -
//   * ОтчетПереработчика          - Булево -
//
Функция ПараметрыИспользования() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ПриобретениеУПоставщика",     Истина);
	Параметры.Вставить("РеализацияКлиенту",           Истина);
	Параметры.Вставить("ОплатаПоставщику",            Истина);
	Параметры.Вставить("ОплатаОтКлиента",             Истина);
	Параметры.Вставить("ВнутренняяНакладная",         Истина);
	Параметры.Вставить("ЗакупкаЧерезПодотчетноеЛицо", Истина);
	Параметры.Вставить("ПриемНаХранение",             Ложь);
	Параметры.Вставить("ОтчетДавальцу",               Ложь);
	Параметры.Вставить("ОтчетПереработчика",          Ложь);
	Параметры.Вставить("КорректировкаПриобретения",   ПолучитьФункциональнуюОпцию("ИспользоватьКорректировкиПриобретений"));
	Параметры.Вставить("КорректировкаРеализации",     ПолучитьФункциональнуюОпцию("ИспользоватьКорректировкиРеализаций"));
	Параметры.Вставить("АктПремииКлиенту",            ПолучитьФункциональнуюОпцию("ИспользоватьРетроБонусыКлиентов"));
	Параметры.Вставить("АктПремииПоставщика",         ПолучитьФункциональнуюОпцию("ИспользоватьРетроБонусыПоставщиков"));
	
	
	//++ НЕ УТ
	ИспользоватьПроизводствоНаСтороне2_5 =
		ПолучитьФункциональнуюОпцию("ИспользоватьПроизводствоНаСтороне2_5");
		
	Параметры.Вставить("ОтчетПереработчика", ИспользоватьПроизводствоНаСтороне2_5);
	//-- НЕ УТ
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

#КонецЕсли
